In [2]:
import pandas as pd
import numpy as np


dates = pd.date_range("20250101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2025-01-01 -1.816066  0.849710  1.715387  0.102682
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589
2025-01-03  2.003262 -0.738401 -0.420147 -0.368238
2025-01-04  0.244182  0.817269  1.147174 -1.030923
2025-01-05 -0.447193  0.646091  1.952295  0.806262
2025-01-06  1.529803 -0.583484 -0.282828 -0.992035

In [3]:
df1 = df.reindex(index=dates[0: 4], columns=list(df.columns) + ['E'])
df1.iloc[0:2,4] = 1
df1

                   A         B         C         D    E
2025-01-01 -1.816066  0.849710  1.715387  0.102682  1.0
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589  1.0
2025-01-03  2.003262 -0.738401 -0.420147 -0.368238  NaN
2025-01-04  0.244182  0.817269  1.147174 -1.030923  NaN

In [4]:
df1.dropna()

                   A         B         C         D    E
2025-01-01 -1.816066  0.849710  1.715387  0.102682  1.0
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589  1.0

In [5]:
df1.fillna(5)

                   A         B         C         D    E
2025-01-01 -1.816066  0.849710  1.715387  0.102682  1.0
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589  1.0
2025-01-03  2.003262 -0.738401 -0.420147 -0.368238  5.0
2025-01-04  0.244182  0.817269  1.147174 -1.030923  5.0

In [6]:
s = pd.Series([1, 3, 1, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    1.0
2025-01-06    NaN
Freq: D, dtype: float64

In [7]:
df

                   A         B         C         D
2025-01-01 -1.816066  0.849710  1.715387  0.102682
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589
2025-01-03  2.003262 -0.738401 -0.420147 -0.368238
2025-01-04  0.244182  0.817269  1.147174 -1.030923
2025-01-05 -0.447193  0.646091  1.952295  0.806262
2025-01-06  1.529803 -0.583484 -0.282828 -0.992035

In [8]:
df.sub(s, axis="index")

                   A         B         C         D
2025-01-01       NaN       NaN       NaN       NaN
2025-01-02       NaN       NaN       NaN       NaN
2025-01-03  1.003262 -1.738401 -1.420147 -1.368238
2025-01-04 -2.755818 -2.182731 -1.852826 -4.030923
2025-01-05 -1.447193 -0.353909  0.952295 -0.193738
2025-01-06       NaN       NaN       NaN       NaN

In [9]:
df

                   A         B         C         D
2025-01-01 -1.816066  0.849710  1.715387  0.102682
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589
2025-01-03  2.003262 -0.738401 -0.420147 -0.368238
2025-01-04  0.244182  0.817269  1.147174 -1.030923
2025-01-05 -0.447193  0.646091  1.952295  0.806262
2025-01-06  1.529803 -0.583484 -0.282828 -0.992035

In [10]:
df.A.transform(lambda x: x*100)

2025-01-01   -181.606597
2025-01-02   -203.249390
2025-01-03    200.326219
2025-01-04     24.418166
2025-01-05    -44.719261
2025-01-06    152.980337
Freq: D, Name: A, dtype: float64

In [11]:
df.agg(lambda x: np.mean(x) * 100)

A    -8.641754
B     6.892173
C    60.251647
D   -22.294391
dtype: float64

In [12]:
pd.concat([df, df]).value_counts()

A          B          C          D
-2.032494  -0.577655  -0.496782   0.144589    2
-1.816066   0.849710   1.715387   0.102682    2
-0.447193   0.646091   1.952295   0.806262    2
 0.244182   0.817269   1.147174  -1.030923    2
 1.529803  -0.583484  -0.282828  -0.992035    2
 2.003262  -0.738401  -0.420147  -0.368238    2
Name: count, dtype: int64

In [13]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [14]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [15]:
df1 = df.copy(deep=True)
df1.columns = df.columns.str.lower()
df1

                   a         b         c         d
2025-01-01 -1.816066  0.849710  1.715387  0.102682
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589
2025-01-03  2.003262 -0.738401 -0.420147 -0.368238
2025-01-04  0.244182  0.817269  1.147174 -1.030923
2025-01-05 -0.447193  0.646091  1.952295  0.806262
2025-01-06  1.529803 -0.583484 -0.282828 -0.992035

In [16]:
df.join(df1)

,A,B,C,D,a,b,c,d
2025-01-01,-1.816066,0.849710,1.715387,0.102682,-1.816066,0.849710,1.715387,0.102682
2025-01-02,-2.032494,-0.577655,-0.496782,0.144589,-2.032494,-0.577655,-0.496782,0.144589
2025-01-03,2.003262,-0.738401,-0.420147,-0.368238,2.003262,-0.738401,-0.420147,-0.368238
2025-01-04,0.244182,0.817269,1.147174,-1.030923,0.244182,0.817269,1.147174,-1.030923
2025-01-05,-0.447193,0.646091,1.952295,0.806262,-0.447193,0.646091,1.952295,0.806262
2025-01-06,1.529803,-0.583484,-0.282828,-0.992035,1.529803,-0.583484,-0.282828,-0.992035

In [17]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

left.merge(right, on='key', how='inner')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [18]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [19]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [20]:
data.drop_duplicates('k1', keep='last')

    k1  k2
4  one   3
6  two   4

In [21]:
class Solution:
    def maxSubArray(self, nums: list[int]) -> int:
        res = float('-inf')
        curr = 0
        for n in nums:
            curr = max(0, curr+n)
            curr += n
            res = max(curr, res)
        
        return res

In [22]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [23]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [24]:
data = pd.Series(np.random.uniform(size=9), index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],  [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.363198
   2    0.309707
   3    0.076496
b  1    0.070370
   3    0.455791
c  1    0.962645
   2    0.197591
d  2    0.328314
   3    0.973447
dtype: float64

In [25]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [26]:
data.b

1    0.070370
3    0.455791
dtype: float64

In [27]:
data

a  1    0.363198
   2    0.309707
   3    0.076496
b  1    0.070370
   3    0.455791
c  1    0.962645
   2    0.197591
d  2    0.328314
   3    0.973447
dtype: float64

In [28]:
data.unstack()

          1         2         3
a  0.363198  0.309707  0.076496
b  0.070370       NaN  0.455791
c  0.962645  0.197591       NaN
d       NaN  0.328314  0.973447

In [29]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": pd.Series(range(6), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"], "data2": pd.Series(range(5), dtype="Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [30]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [31]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [32]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [33]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [34]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [35]:
df1.set_index('key').join(df2.set_index('key'))

     data1  data2
key
b        0      1
b        0      3
b        1      1
b        1      3
a        2      0
a        2      2
c        3   <NA>
a        4      0
a        4      2
b        5      1
b        5      3

In [36]:
df['day'] = ['m','t','w']*2
df

                   A         B         C         D day
2025-01-01 -1.816066  0.849710  1.715387  0.102682   m
2025-01-02 -2.032494 -0.577655 -0.496782  0.144589   t
2025-01-03  2.003262 -0.738401 -0.420147 -0.368238   w
2025-01-04  0.244182  0.817269  1.147174 -1.030923   m
2025-01-05 -0.447193  0.646091  1.952295  0.806262   t
2025-01-06  1.529803 -0.583484 -0.282828 -0.992035   w

In [37]:
df.groupby('day')[['A', 'B']].agg([ ('avg', 'mean'), ('std', np.std) ])

C:\Users\Utsav\AppData\Local\Temp\ipykernel_21632\1519244694.py:1: FutureWarning: The provided callable <function std at 0x0000024AC08E09A0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  df.groupby('day')[['A', 'B']].agg([ ('avg', 'mean'), ('std', np.std) ])

            A                   B
          avg       std       avg       std
day
m   -0.785942  1.456815  0.833489  0.022939
t   -1.239843  1.120977  0.034218  0.865319
w    1.766533  0.334786 -0.660942  0.109543

In [38]:
df.groupby('day')[['A', 'B']].agg({'A':'mean', 'B': 'std'})

            A         B
day
m   -0.785942  0.022939
t   -1.239843  0.865319
w    1.766533  0.109543

In [39]:
df.groupby('day', as_index=False)[['A', 'B']].describe()

  day     A                                                              \
      count      mean       std       min       25%       50%       75%
0   m   2.0 -0.785942  1.456815 -1.816066 -1.301004 -0.785942 -0.270880
1   t   2.0 -1.239843  1.120977 -2.032494 -1.636169 -1.239843 -0.843518
2   w   2.0  1.766533  0.334786  1.529803  1.648168  1.766533  1.884897

                B                                                              \
        max count      mean       std       min       25%       50%       75%
0  0.244182   2.0  0.833489  0.022939  0.817269  0.825379  0.833489  0.841600
1 -0.447193   2.0  0.034218  0.865319 -0.577655 -0.271718  0.034218  0.340154
2  2.003262   2.0 -0.660942  0.109543 -0.738401 -0.699671 -0.660942 -0.622213


        max
0  0.849710
1  0.646091
2 -0.583484

In [40]:
df = pd.DataFrame({
    'stock': ['a', 'a', 'a', 'b', 'c','c'],
    'px': [100, 101, 101.1, 10, 11, 12]
})

df

  stock     px
0     a  100.0
1     a  101.0
2     a  101.1
3     b   10.0
4     c   11.0
5     c   12.0

In [41]:
result = df.groupby('stock', as_index=False)['px'].pct_change().dropna()
df.loc[result.index, ['stock', 'px']].assign(pct_change=result.values)

  stock     px  pct_change
1     a  101.0    0.010000
2     a  101.1    0.000990
5     c   12.0    0.090909

In [42]:
df.groupby('stock')[['px']].apply('mean')

          px
stock
a      100.7
b       10.0
c       11.5

In [43]:
df.groupby('stock')[['px']].transform('mean')

      px
0  100.7
1  100.7
2  100.7
3   10.0
4   11.5
5   11.5

In [58]:
ts = pd.Series(np.arange(1, 11),index=pd.date_range("2000-01-01", periods=10))
ts

2000-01-01     1
2000-01-02     2
2000-01-03     3
2000-01-04     4
2000-01-05     5
2000-01-06     6
2000-01-07     7
2000-01-08     8
2000-01-09     9
2000-01-10    10
Freq: D, dtype: int32

In [59]:
df = pd.DataFrame(ts, columns=['vals'])
df['nval'] = df.vals.shift(1)*df.vals
df

            vals  nval
2000-01-01     1   NaN
2000-01-02     2   2.0
2000-01-03     3   6.0
2000-01-04     4  12.0
2000-01-05     5  20.0
2000-01-06     6  30.0
2000-01-07     7  42.0
2000-01-08     8  56.0
2000-01-09     9  72.0
2000-01-10    10  90.0

In [61]:
(ts / ts.shift(1)) - 1

2000-01-01         NaN
2000-01-02    1.000000
2000-01-03    0.500000
2000-01-04    0.333333
2000-01-05    0.250000
2000-01-06    0.200000
2000-01-07    0.166667
2000-01-08    0.142857
2000-01-09    0.125000
2000-01-10    0.111111
Freq: D, dtype: float64

In [63]:
import polars as pl
import datetime as dt

df = pl.DataFrame(
    {
        "name": ["Alice Archer", "Ben Brown", "Chloe Cooper", "Daniel Donovan"],
        "birthdate": [
            dt.date(1997, 1, 10),
            dt.date(1985, 2, 15),
            dt.date(1983, 3, 22),
            dt.date(1981, 4, 30),
        ],
        "weight": [57.9, 72.5, 53.6, 83.1],  # (kg)
        "height": [1.56, 1.77, 1.65, 1.75],  # (m)
    }
)

print(df)

shape: (4, 4)

 name            birthdate   weight  height
 ---             ---         ---     ---
 str             date        f64     f64

 Alice Archer    1997-01-10  57.9    1.56
 Ben Brown       1985-02-15  72.5    1.77
 Chloe Cooper    1983-03-22  53.6    1.65
 Daniel Donovan  1981-04-30  83.1    1.75

In [ ]:
#pl.select
# pl.with_columns
# pl.filters
# pl.groupby